modm-ext/data.modm.io/docs/svd/header_stm32n657xx.svd
        <register>
          <name>FVRw351</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x57c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw352</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x580</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw353</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x584</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw354</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x588</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw355</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x58c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw356</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x590</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw357</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x594</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw358</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x598</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw359</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x59c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw360</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5a0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw361</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5a4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw362</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5a8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw363</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5ac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw364</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5b0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw365</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5b4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw366</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5b8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw367</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5bc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw368</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5c0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw369</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5c4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw370</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5c8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw371</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5cc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw372</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5d0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw373</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5d4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw374</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5d8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw375</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5dc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw376</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5e0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw377</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5e4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw378</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5e8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw379</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5ec</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw380</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5f0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw381</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5f4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw382</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5f8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FVRw383</name>
          <description>BSEC fuse word (0-383) value register</description>
          <addressOffset>0x5fc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FV</name>
              <description>Fuse value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPLOCK0</name>
          <description>BSEC sticky program lock register (0-11)</description>
          <addressOffset>0x800</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPLOCK0</name>
              <description>Sticky programming lock for word (32 x)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK1</name>
              <description>Sticky programming lock for word (1+32 x)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK2</name>
              <description>Sticky programming lock for word (2+32 x)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK3</name>
              <description>Sticky programming lock for word (3+32 x)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK4</name>
              <description>Sticky programming lock for word (4+32 x)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK5</name>
              <description>Sticky programming lock for word (5+32 x)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK6</name>
              <description>Sticky programming lock for word (6+32 x)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK7</name>
              <description>Sticky programming lock for word (7+32 x)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK8</name>
              <description>Sticky programming lock for word (8+32 x)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK9</name>
              <description>Sticky programming lock for word (9+32 x)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK10</name>
              <description>Sticky programming lock for word (10+32 x)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK11</name>
              <description>Sticky programming lock for word (11+32 x)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK12</name>
              <description>Sticky programming lock for word (12+32 x)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK13</name>
              <description>Sticky programming lock for word (13+32 x)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK14</name>
              <description>Sticky programming lock for word (14+32 x)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK15</name>
              <description>Sticky programming lock for word (15+32 x)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK16</name>
              <description>Sticky programming lock for word (16+32 x)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK17</name>
              <description>Sticky programming lock for word (17+32 x)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK18</name>
              <description>Sticky programming lock for word (18+32 x)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK19</name>
              <description>Sticky programming lock for word (19+32 x)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK20</name>
              <description>Sticky programming lock for word (20+32 x)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK21</name>
              <description>Sticky programming lock for word (21+32 x)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK22</name>
              <description>Sticky programming lock for word (22+32 x)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK23</name>
              <description>Sticky programming lock for word (23+32 x)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK24</name>
              <description>Sticky programming lock for word (24+32 x)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK25</name>
              <description>Sticky programming lock for word (25+32 x)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK26</name>
              <description>Sticky programming lock for word (26+32 x)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK27</name>
              <description>Sticky programming lock for word (27+32 x)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK28</name>
              <description>Sticky programming lock for word (28+32 x)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK29</name>
              <description>Sticky programming lock for word (29+32 x)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK30</name>
              <description>Sticky programming lock for word (30+32 x)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLOCK31</name>
              <description>Sticky programming lock for word (31+32 x)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
