modm-ext/data.modm.io/docs/svd/header_stm32n657xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x46020400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOC</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x46020800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOD</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x46020c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOE</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x46021000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOF</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x46021400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOG</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x46021800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOH</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x46021c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPION</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x46023400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOO</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x46023800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOP</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x46023c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOQ</name>
      <description>General Purpose I/O</description>
      <baseAddress>0x46024000</baseAddress>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power Control</description>
      <baseAddress>0x46024800</baseAddress>
      <registers>
        <register>
          <name>CR1</name>
          <description>PWR Control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SDEN</name>
              <description>SMPS step-down converter enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMPS_SUPPLY</name>
                  <description>Core domains are supplied from the SMPS</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTERNAL_SOURCE_SUPPLY</name>
                  <description>The SMPS is Bypassed. The Core domains are supplied from an external source</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE_PDN</name>
              <description>Pull down on output voltage during power down mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPDS08V</name>
              <description>SMPS Low power mode enable (SVOS high only)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDD18SMPSVMEN</name>
              <description>VDD18SMPS voltage monitor enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDD18SMPSRDY</name>
              <description>VDD18SMPS ready</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POPL</name>
              <description>pwr_on pulse low configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>PWR Control Register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PVDEN</name>
              <description>Programmable Voltage detector enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDO</name>
              <description>Programmable Voltage Detect Output</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <description>PWR Control Register 3</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>VCOREMONEN</name>
              <description>VDDCORE monitoring enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VCORELLS</name>
              <description>VDDCORE Voltage Detector low level selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCALE1</name>
                  <description>VDDCORE low-voltage threshold 1 selected (VOS 1)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE0</name>
                  <description>VDDCORE low-voltage threshold 2 selected (VOS 0)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VCOREL</name>
              <description>Monitored VDDCORE level above low threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VCOREH</name>
              <description>Monitored VDDCORE level above high threshold</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR4</name>
          <description>PWR Control Register 4</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TCMRBSEN</name>
              <description>I-TCM and D-TCM RAMs backup supply enable (used to maintain TCM RAMs content in Standby mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCMFLXRBSEN</name>
              <description>I-TCM FLEX MEM backup supply enable (used to maintain I-TCM FLEX MEM content in Standby mode)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VOSCR</name>
          <description>PWR Voltage scaling control register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>VOS</name>
              <description>Voltage scaling selection according to performance</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCALE0</name>
                  <description>Voltage scaling range 0 (highest frequency)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE1</name>
                  <description>Voltage scaling range 1 (lowest power)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VOSRDY</name>
              <description>VOS Ready bit for VCORE voltage scaling output selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTVOS</name>
              <description>VOS currently applied for VCORE voltage scaling selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTVOSRDY</name>
              <description>Voltage levels ready bit for currently used ACTVOS</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDCR1</name>
          <description>PWR Backup domain control register 1</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MONEN</name>
              <description>VBAT and temperature monitoring enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBATL</name>
              <description>VBAT level monitoring versus low threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBATH</name>
              <description>VBAT level monitoring versus high threshold</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEMPL</name>
              <description>Temperature level monitoring versus low threshold</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TEMPH</name>
              <description>Temperature level monitoring versus high threshold</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDCR2</name>
          <description>PWR Backup domain control register 2</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BKPRBSEN</name>
              <description>Backup RAM backup supply enable (used to maintain BKP RAM content in Standby and VBAT modes)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBPCR</name>
          <description>PWR Disable backup protection control register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBP</name>
              <description>Disable backup domain write protection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUCR</name>
          <description>PWR CPU control register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PDDS</name>
              <description>Power Down Deepsleep selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Enter to Stop mode when the CPU enters deepsleep</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY</name>
                  <description>Enter to Standby mode when the CPU enters deepsleep</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSSF</name>
              <description>Clear Standby and Stop flags (always read as 0)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STOPF</name>
              <description>STOP flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SBF</name>
              <description>System Standby flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SVOS</name>
              <description>System Stop mode voltage scaling selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCALE3</name>
                  <description>Voltage scaling range 3 (highest frequency) when system enters STOP mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE5</name>
                  <description>Voltage scaling range 5 (lowest power) when system enters STOP mode</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SVMCR1</name>
          <description>PWR Supply voltage monitoring control register 1</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>VDDIO4VMEN</name>
              <description>VDDOI4 Independent I/Os voltage monitor enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO4SV</name>
              <description>VDDIO4 Independent I/Os supply valid</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO4RDY</name>
              <description>VDDIO4 ready</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO4VRSEL</name>
              <description>VDDIO4 IO voltage range selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO4VRSTBY</name>
              <description>VDDIO4 IO voltage range standby mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SVMCR2</name>
          <description>PWR Supply voltage monitoring control register 2</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>VDDIO5VMEN</name>
              <description>VDDIO5 Independent voltage monitor enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO5SV</name>
              <description>VDDIO5 Independent supply valid</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO5RDY</name>
              <description>VDDIO5 ready</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO5VRSEL</name>
              <description>VDDIO5 IO voltage range selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO5VRSTBY</name>
              <description>VDDIO5 IO voltage range standby mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SVMCR3</name>
          <description>PWR Supply voltage monitoring control register 3</description>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>VDDIO2VMEN</name>
              <description>VDDIO2 Independent voltage monitor enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO3VMEN</name>
              <description>VDDIO3 Independent voltage monitor enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB33VMEN</name>
              <description>VDD33USB Independent USB 33 voltage monitor enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AVMEN</name>
              <description>VDDA18ADC Independent ADC voltage monitor enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO2SV</name>
              <description>VDDIO2 Independent supply valid</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO3SV</name>
              <description>VDDIO3 Independent supply valid</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB33SV</name>
              <description>VDD33USB Independent supply valid</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASV</name>
              <description>VDDA18ADC Independent supply valid</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO2RDY</name>
              <description>VDDIO2 ready</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO3RDY</name>
              <description>VDDIO3 ready</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB33RDY</name>
              <description>VDD33USB ready</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ARDY</name>
              <description>VDDA18ADC ready</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIOVRSEL</name>
              <description>VDD IO voltage range selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO2VRSEL</name>
              <description>VDDIO2 IO voltage range selection</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VDDIO3VRSEL</name>
              <description>VDDIO3 IO voltage range selection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUPCR</name>
          <description>PWR Wakeup control register 1</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WKUPC1</name>
              <description>Clear Wakeup Flag for WKUP1 pin</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPC2</name>
              <description>Clear Wakeup Flag for WKUP2 pin</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPC3</name>
              <description>Clear Wakeup Flag for WKUP3 pin</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPC4</name>
              <description>Clear Wakeup Flag for WKUP4 pin</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUPSR</name>
          <description>PWR Wakeup control register 2</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WKUPF1</name>
              <description>Wakeup Flag for WKUP1 pin</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPF2</name>
              <description>Wakeup Flag for WKUP2 pin</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPF3</name>
              <description>Wakeup Flag for WKUP3 pin</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WKUPF4</name>
              <description>Wakeup Flag for WKUP4 pin</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
