modm-ext/data.modm.io/docs/svd/header_stm32n657xx.svd
        <register>
          <name>CCIPR2</name>
          <description>RCC clock configuration for independent peripheral register 2</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ETH1PTPSEL</name>
              <description>Source selection for the ETH1 kernel clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HCLK</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKP</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC13</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETH1PTPDIV</name>
              <description>ETH1 Kernel clock divider selection (for clock ck_ker_eth1ptp)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_5</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_6</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_7</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_9</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_10</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_11</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_12</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_13</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_14</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_15</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETH1PWRDOWNACK</name>
              <description>Set and reset by software</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETH1CLKSEL</name>
              <description>Source selection for the ETH1 kernel clock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HCLK</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKP</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC12</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETH1SEL</name>
              <description>Set and reset by software</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MII</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGMII</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RMII</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IF</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETH1REFCLKSEL</name>
              <description>Set and reset by software</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETH1GTXCLKSEL</name>
              <description>Set and reset by software</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR3</name>
          <description>RCC clock configuration for independent peripheral register 3</description>
          <addressOffset>0x14c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FDCANSEL</name>
              <description>Source selection for the FDCAN kernel clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLK1</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKP</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC19</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMCSEL</name>
              <description>Source selection for the FMC kernel clock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HCLK</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKP</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC3</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC4</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFTSEL</name>
              <description>Source selection for the DFT kernel clock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR4</name>
          <description>RCC clock configuration for independent peripheral register 4</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2C1SEL</name>
              <description>Source selection for the I2C1 kernel clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>I2C2SEL</name>
              <description>Source selection for the I2C2 kernel clock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>I2C3SEL</name>
              <description>Source selection for the I2C3 kernel clock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>I2C4SEL</name>
              <description>Source selection for the I2C4 kernel clock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>I3C1SEL</name>
              <description>Source selection for the I3C1 kernel clock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>I3C2SEL</name>
              <description>Source selection for the I3C2 kernel clock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LTDCSEL</name>
              <description>Source selection for the LTDC kernel clock</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLK5</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKP</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC16</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR5</name>
          <description>RCC clock configuration for independent peripheral register 5</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MCO1SEL</name>
              <description>Source selection for the MCO1 kernel clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MCO1PRE</name>
              <description>MCO1 Kernel clock divider selection (for clock MCO1)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MCO2SEL</name>
              <description>Source selection for the MCO2 kernel clock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MCO2PRE</name>
              <description>MCO2 Kernel clock divider selection (for clock MCO2)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MDF1SEL</name>
              <description>Source selection for the MDF1 kernel clock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HCLK</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKP</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC7</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IC8</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSI</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_CKIN</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMG</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR6</name>
          <description>RCC clock configuration for independent peripheral register 6</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XSPI1SEL</name>
              <description>Source selection for the XSPI1 kernel clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>XSPI2SEL</name>
              <description>Source selection for the XSPI2 kernel clock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>XSPI3SEL</name>
              <description>Source selection for the XSPI3 kernel clock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OTGPHY1SEL</name>
              <description>Source selection for the OTGPHY1 kernel clock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OTGPHY1CKREFSEL</name>
              <description>Set and reset by software</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTGPHY2SEL</name>
              <description>Source selection for the OTGPHY2 kernel clock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OTGPHY2CKREFSEL</name>
              <description>Set and reset by software</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
