modm-ext/data.modm.io/docs/svd/header_stm32n657xx.svd
        <register>
          <name>PRIVCFGR1</name>
          <description>RCC PLL privilege configuration register 1</description>
          <addressOffset>0x794</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PLL1PRIV</name>
              <description>Privileged protection of PLL1 configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2PRIV</name>
              <description>Privileged protection of PLL2 configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3PRIV</name>
              <description>Privileged protection of PLL3 configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL4PRIV</name>
              <description>Privileged protection of PLL4 configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKCFGR1</name>
          <description>RCC PLL lock configuration register 1</description>
          <addressOffset>0x798</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PLL1LOCK</name>
              <description>Locked protection of PLL1 configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2LOCK</name>
              <description>Locked protection of PLL2 configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3LOCK</name>
              <description>Locked protection of PLL3 configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL4LOCK</name>
              <description>Locked protection of PLL4 configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGR1</name>
          <description>RCC PLL public configuration register 1</description>
          <addressOffset>0x79c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PLL1PUB</name>
              <description>Public protection of PLL1 configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2PUB</name>
              <description>Public protection of PLL2 configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3PUB</name>
              <description>Public protection of PLL3 configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL4PUB</name>
              <description>Public protection of PLL4 configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECCFGR2</name>
          <description>RCC divider secure configuration register 2</description>
          <addressOffset>0x7a0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IC1SEC</name>
              <description>Secure protection of IC1 divider configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2SEC</name>
              <description>Secure protection of IC2 divider configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3SEC</name>
              <description>Secure protection of IC3 divider configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4SEC</name>
              <description>Secure protection of IC4 divider configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC5SEC</name>
              <description>Secure protection of IC5 divider configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC6SEC</name>
              <description>Secure protection of IC6 divider configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC7SEC</name>
              <description>Secure protection of IC7 divider configuration bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC8SEC</name>
              <description>Secure protection of IC8 divider configuration bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC9SEC</name>
              <description>Secure protection of IC9 divider configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC10SEC</name>
              <description>Secure protection of IC10 divider configuration bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC11SEC</name>
              <description>Secure protection of IC11 divider configuration bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC12SEC</name>
              <description>Secure protection of IC12 divider configuration bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC13SEC</name>
              <description>Secure protection of IC13 divider configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC14SEC</name>
              <description>Secure protection of IC14 divider configuration bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC15SEC</name>
              <description>Secure protection of IC15 divider configuration bits</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC16SEC</name>
              <description>Secure protection of IC16 divider configuration bits</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC17SEC</name>
              <description>Secure protection of IC17 divider configuration bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC18SEC</name>
              <description>Secure protection of IC18 divider configuration bits</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC19SEC</name>
              <description>Secure protection of IC19 divider configuration bits</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC20SEC</name>
              <description>Secure protection of IC20 divider configuration bits</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGR2</name>
          <description>RCC divider privilege configuration register 2</description>
          <addressOffset>0x7a4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IC1PRIV</name>
              <description>Privileged protection of IC1 divider configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2PRIV</name>
              <description>Privileged protection of IC2 divider configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3PRIV</name>
              <description>Privileged protection of IC3 divider configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4PRIV</name>
              <description>Privileged protection of IC4 divider configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC5PRIV</name>
              <description>Privileged protection of IC5 divider configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC6PRIV</name>
              <description>Privileged protection of IC6 divider configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC7PRIV</name>
              <description>Privileged protection of IC7 divider configuration bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC8PRIV</name>
              <description>Privileged protection of IC8 divider configuration bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC9PRIV</name>
              <description>Privileged protection of IC9 divider configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC10PRIV</name>
              <description>Privileged protection of IC10 divider configuration bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC11PRIV</name>
              <description>Privileged protection of IC11 divider configuration bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC12PRIV</name>
              <description>Privileged protection of IC12 divider configuration bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC13PRIV</name>
              <description>Privileged protection of IC13 divider configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC14PRIV</name>
              <description>Privileged protection of IC14 divider configuration bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC15PRIV</name>
              <description>Privileged protection of IC15 divider configuration bits</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC16PRIV</name>
              <description>Privileged protection of IC16 divider configuration bits</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC17PRIV</name>
              <description>Privileges protection of IC17 divider configuration bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC18PRIV</name>
              <description>Privilege protection of IC18 divider configuration bits</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC19PRIV</name>
              <description>Privileged protection of IC19 divider configuration bits</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC20PRIV</name>
              <description>Privileged protection of IC20 divider configuration bits</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKCFGR2</name>
          <description>RCC divider lock configuration register 2</description>
          <addressOffset>0x7a8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IC1LOCK</name>
              <description>Locked protection of IC1 divider configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2LOCK</name>
              <description>Locked protection of IC2 divider configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3LOCK</name>
              <description>Locked protection of IC3 divider configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4LOCK</name>
              <description>Locked protection of IC4 divider configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC5LOCK</name>
              <description>Locked protection of IC5 divider configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC6LOCK</name>
              <description>Locked protection of IC6 divider configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC7LOCK</name>
              <description>Locked protection of IC7 divider configuration bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC8LOCK</name>
              <description>Locked protection of IC8 divider configuration bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC9LOCK</name>
              <description>Locked protection of IC9 divider configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC10LOCK</name>
              <description>Locked protection of IC10 divider configuration bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC11LOCK</name>
              <description>Locked protection of IC11 divider configuration bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC12LOCK</name>
              <description>Locked protection of IC12 divider configuration bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC13LOCK</name>
              <description>Locked protection of IC13 divider configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC14LOCK</name>
              <description>Locked protection of IC14 divider configuration bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC15LOCK</name>
              <description>Locked protection of IC15 divider configuration bits</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC16LOCK</name>
              <description>Locked protection of IC16 divider configuration bits</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC17LOCK</name>
              <description>Locked protection of IC17 divider configuration bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC18LOCK</name>
              <description>Locked protection of IC18 divider configuration bits</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC19LOCK</name>
              <description>Locked protection of IC19 divider configuration bits</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC20LOCK</name>
              <description>Locked protection of IC20 divider configuration bits</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
