modm-ext/data.modm.io/docs/svd/header_stm32n657xx.svd
        <register>
          <name>PUBCFGR2</name>
          <description>RCC divider public configuration register 2</description>
          <addressOffset>0x7ac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IC1PUB</name>
              <description>Public protection of IC1 divider configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2PUB</name>
              <description>Public protection of IC2 divider configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3PUB</name>
              <description>Public protection of IC3 divider configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4PUB</name>
              <description>Public protection of IC4 divider configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC5PUB</name>
              <description>Public protection of IC5 divider configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC6PUB</name>
              <description>Public protection of IC6 divider configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC7PUB</name>
              <description>Public protection of IC7 divider configuration bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC8PUB</name>
              <description>Public protection of IC8 divider configuration bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC9PUB</name>
              <description>Public protection of IC9 divider configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC10PUB</name>
              <description>Public protection of IC10 divider configuration bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC11PUB</name>
              <description>Public protection of IC11 divider configuration bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC12PUB</name>
              <description>Public protection of IC12 divider configuration bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC13PUB</name>
              <description>Public protection of IC13 divider configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC14PUB</name>
              <description>Public protection of IC14 divider configuration bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC15PUB</name>
              <description>Public protection of IC15 divider configuration bits</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC16PUB</name>
              <description>Public protection of IC16 divider configuration bits</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC17PUB</name>
              <description>Public protection of IC17 divider configuration bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC18PUB</name>
              <description>Public protection of IC18 divider configuration bits</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC19PUB</name>
              <description>Public protection of IC19 divider configuration bits</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC20PUB</name>
              <description>Public protection of IC20 divider configuration bits</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECCFGR3</name>
          <description>RCC system secure configuration register 3</description>
          <addressOffset>0x7b0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODSEC</name>
              <description>Secure protection of MOD system configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSSEC</name>
              <description>Secure protection of SYS system configuration bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSSEC</name>
              <description>Secure protection of BUS system configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERSEC</name>
              <description>Secure protection of PER system configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTSEC</name>
              <description>Secure protection of INT system configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTSEC</name>
              <description>Secure protection of RST system configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGR3</name>
          <description>RCC system privilege configuration register 3</description>
          <addressOffset>0x7b4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODPRIV</name>
              <description>Privileged protection of MOD system configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSPRIV</name>
              <description>Privileged protection of SYS system configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSPRIV</name>
              <description>Privileged protection of BUS system configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERPRIV</name>
              <description>Privileged protection of PER system configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTPRIV</name>
              <description>Privileged protection of INT system configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTPRIV</name>
              <description>Privileged protection of RST system configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKCFGR3</name>
          <description>RCC system lock configuration register 3</description>
          <addressOffset>0x7b8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODLOCK</name>
              <description>Locked protection of MOD system configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSLOCK</name>
              <description>Locked protection of SYS system configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSLOCK</name>
              <description>Locked protection of BUS system configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERLOCK</name>
              <description>Locked protection of PER system configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTLOCK</name>
              <description>Locked protection of INT system configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTLOCK</name>
              <description>Locked protection of RST system configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGR3</name>
          <description>RCC system public configuration register 3</description>
          <addressOffset>0x7bc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODPUB</name>
              <description>Public protection of MOD system configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSPUB</name>
              <description>Public protection of SYS system configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSPUB</name>
              <description>Public protection of BUS system configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERPUB</name>
              <description>Public protection of PER system configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTPUB</name>
              <description>Public protection of INT system configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTPUB</name>
              <description>Public protection of RST system configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECCFGR4</name>
          <description>RCC bus secure configuration register 4</description>
          <addressOffset>0x7c0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACLKNSEC</name>
              <description>Secure protection of ACLKN bus configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACLKNCSEC</name>
              <description>Secure protection of ACLKNC bus configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBMSEC</name>
              <description>Secure protection of AHBM bus configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB1SEC</name>
              <description>Secure protection of AHB1 bus configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2SEC</name>
              <description>Secure protection of AHB2 bus configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB3SEC</name>
              <description>Secure protection of AHB3 bus configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB4SEC</name>
              <description>Secure protection of AHB4 bus configuration bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB5SEC</name>
              <description>Secure protection of AHB5 bus configuration bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB1SEC</name>
              <description>Secure protection of APB1 bus configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB2SEC</name>
              <description>Secure protection of APB2 bus configuration bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB3SEC</name>
              <description>Secure protection of APB3 bus configuration bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB4SEC</name>
              <description>Secure protection of APB4 bus configuration bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB5SEC</name>
              <description>Secure protection of APB5 bus configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOCSEC</name>
              <description>Secure protection of NOC bus configuration bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGR4</name>
          <description>RCC bus privilege configuration register 4</description>
          <addressOffset>0x7c4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACLKNPRIV</name>
              <description>Privileged protection of ACLKN bus configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACLKNCPRIV</name>
              <description>Privileged protection of ACLKNC bus configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBMPRIV</name>
              <description>Privileged protection of AHBM bus configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB1PRIV</name>
              <description>Privileged protection of AHB1 bus configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2PRIV</name>
              <description>Privileged protection of AHB2 bus configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB3PRIV</name>
              <description>Privileged protection of AHB3 bus configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB4PRIV</name>
              <description>Privileged protection of AHB4 bus configuration bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB5PRIV</name>
              <description>Privileged protection of AHB5 bus configuration bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB1PRIV</name>
              <description>Privileged protection of APB1 bus configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB2PRIV</name>
              <description>Privileged protection of APB2 bus configuration bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB3PRIV</name>
              <description>Privileged protection of APB3 bus configuration bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB4PRIV</name>
              <description>Privileged protection of APB4 bus configuration bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB5PRIV</name>
              <description>Privileged protection of APB5 bus configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOCPRIV</name>
              <description>Privileged protection of NOC bus configuration bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKCFGR4</name>
          <description>RCC bus lock configuration register 4</description>
          <addressOffset>0x7c8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACLKNLOCK</name>
              <description>Locked protection of ACLKN bus configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACLKNCLOCK</name>
              <description>Locked protection of ACLKNC bus configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBMLOCK</name>
              <description>Locked protection of AHBM bus configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB1LOCK</name>
              <description>Locked protection of AHB1 bus configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2LOCK</name>
              <description>Locked protection of AHB2 bus configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB3LOCK</name>
              <description>Locked protection of AHB3 bus configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB4LOCK</name>
              <description>Locked protection of AHB4 bus configuration bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB5LOCK</name>
              <description>Locked protection of AHB5 bus configuration bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB1LOCK</name>
              <description>Locked protection of APB1 bus configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB2LOCK</name>
              <description>Locked protection of APB2 bus configuration bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB3LOCK</name>
              <description>Locked protection of APB3 bus configuration bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB4LOCK</name>
              <description>Locked protection of APB4 bus configuration bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB5LOCK</name>
              <description>Locked protection of APB5 bus configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOCLOCK</name>
              <description>Locked protection of NOC bus configuration bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
