modm-ext/data.modm.io/docs/svd/header_stm32n657xx.svd
        <register>
          <name>BUSENSR</name>
          <description>RCC bus enable register</description>
          <addressOffset>0xa44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACLKNENS</name>
              <description>ACLKN enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACLKNCENS</name>
              <description>ACLKNC enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBMENS</name>
              <description>AHBM enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB1ENS</name>
              <description>AHB1 enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2ENS</name>
              <description>AHB2 enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB3ENS</name>
              <description>AHB3 enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB4ENS</name>
              <description>AHB4 enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB5ENS</name>
              <description>AHB5 enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB1ENS</name>
              <description>APB1 enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB2ENS</name>
              <description>APB2 enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB3ENS</name>
              <description>APB3 enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB4ENS</name>
              <description>APB4 enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB5ENS</name>
              <description>APB5 enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MISCENSR</name>
          <description>RCC miscellaneous enable register</description>
          <addressOffset>0xa48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBGENS</name>
              <description>DBG enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCO1ENS</name>
              <description>MCO1 enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCO2ENS</name>
              <description>MCO2 enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPIPHYCOMPENS</name>
              <description>XSPIPHYCOMP enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERENS</name>
              <description>PER enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMENSR</name>
          <description>RCC memory enable register</description>
          <addressOffset>0xa4c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AXISRAM3ENS</name>
              <description>AXISRAM3 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM4ENS</name>
              <description>AXISRAM4 enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM5ENS</name>
              <description>AXISRAM5 enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM6ENS</name>
              <description>AXISRAM6 enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBSRAM1ENS</name>
              <description>AHBSRAM1 enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBSRAM2ENS</name>
              <description>AHBSRAM2 enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKPSRAMENS</name>
              <description>BKPSRAM enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM1ENS</name>
              <description>AXISRAM1 enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM2ENS</name>
              <description>AXISRAM2 enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLEXRAMENS</name>
              <description>FLEXRAM enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CACHEAXIRAMENS</name>
              <description>CACHEAXIRAM enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VENCRAMENS</name>
              <description>VENCRAM enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOTROMENS</name>
              <description>Boot ROM enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB1ENSR</name>
          <description>RCC AHB1 enable register</description>
          <addressOffset>0xa50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GPDMA1ENS</name>
              <description>GPDMA1 enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC12ENS</name>
              <description>ADC12 enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB2ENSR</name>
          <description>RCC AHB2 enable register</description>
          <addressOffset>0xa54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RAMCFGENS</name>
              <description>RAMCFG enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MDF1ENS</name>
              <description>MDF1 enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADF1ENS</name>
              <description>ADF1 enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB3ENSR</name>
          <description>RCC AHB3 enable register</description>
          <addressOffset>0xa58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RNGENS</name>
              <description>RNG enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HASHENS</name>
              <description>HASH enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRYPENS</name>
              <description>CRYP enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAESENS</name>
              <description>SAES enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKAENS</name>
              <description>PKA enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RIFSCENS</name>
              <description>RIFSC enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IACENS</name>
              <description>IAC enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RISAFENS</name>
              <description>RISAF enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB4ENSR</name>
          <description>RCC AHB4 enable register</description>
          <addressOffset>0xa5c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GPIOAENS</name>
              <description>GPIO A enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOBENS</name>
              <description>GPIO B enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOCENS</name>
              <description>GPIO C enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIODENS</name>
              <description>GPIO D enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOEENS</name>
              <description>GPIO E enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOFENS</name>
              <description>GPIO F enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOGENS</name>
              <description>GPIO G enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOHENS</name>
              <description>GPIO H enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIONENS</name>
              <description>GPIO N enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOOENS</name>
              <description>GPIO O enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOPENS</name>
              <description>GPIO P enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPIOQENS</name>
              <description>GPIO Q enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWRENS</name>
              <description>PWR enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRCENS</name>
              <description>CRC enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB5ENSR</name>
          <description>RCC AHB5 enable register</description>
          <addressOffset>0xa60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HPDMA1ENS</name>
              <description>HPDMA1 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMA2DENS</name>
              <description>DMA2D enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JPEGENS</name>
              <description>JPEG enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMCENS</name>
              <description>FMC enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPI1ENS</name>
              <description>XSPI1 enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSSIENS</name>
              <description>PSSI enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC2ENS</name>
              <description>SDMMC2 enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC1ENS</name>
              <description>SDMMC1 enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPI2ENS</name>
              <description>XSPI2 enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPIMENS</name>
              <description>XSPIM enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCE1ENS</name>
              <description>MCE1 enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCE2ENS</name>
              <description>MCE2 enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCE3ENS</name>
              <description>MCE3 enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPI3ENS</name>
              <description>XSPI3 enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCE4ENS</name>
              <description>MCE4 enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GFXMMUENS</name>
              <description>GFXMMU enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPU2DENS</name>
              <description>GPU2D enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETH1MACENS</name>
              <description>ETH1MAC enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETH1TXENS</name>
              <description>ETH1TX enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETH1RXENS</name>
              <description>ETH1RX enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ETH1ENS</name>
              <description>ETH1 enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTG1ENS</name>
              <description>OTG1 enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTGPHY1ENS</name>
              <description>OTGPHY1 enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTGPHY2ENS</name>
              <description>OTGPHY2 enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTG2ENS</name>
              <description>OTG2 enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CACHEAXIENS</name>
              <description>CACHEAXI enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NPUENS</name>
              <description>NPU enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
