modm-ext/data.modm.io/docs/svd/header_stm32n657xx.svd
        <register>
          <name>PRIVCFGSR4</name>
          <description>RCC privilege configuration set register 4</description>
          <addressOffset>0xfc4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACLKNPRIVS</name>
              <description>Privileged protection of ACLKN configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACLKNCPRIVS</name>
              <description>Privileged protection of th ACLKNC configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBMPRIVS</name>
              <description>Privileged protection of AHBM configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB1PRIVS</name>
              <description>Privileged protection of AHB1 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2PRIVS</name>
              <description>Privileged protection of AHB2 configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB3PRIVS</name>
              <description>Privileged protection of AHB3 configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB4PRIVS</name>
              <description>Privileged protection of AHB4 configuration bits (enable, ready, divider)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB5PRIVS</name>
              <description>Privileged protection of AHB5 configuration bits (enable, ready, divider)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB1PRIVS</name>
              <description>Privileged protection of APB1 configuration bits (enable, ready, divider)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB2PRIVS</name>
              <description>Privileged protection of APB2 configuration bits (enable, ready, divider)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB3PRIVS</name>
              <description>Privileged protection of APB3 configuration bits (enable, ready, divider)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB4PRIVS</name>
              <description>Privileged protection of APB4 configuration bits (enable, ready, divider)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB5PRIVS</name>
              <description>Privileged protection of APB5 configuration bits (enable, ready, divider)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOCPRIVS</name>
              <description>Privileged protection of NOC configuration bits (enable, ready, divider)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGSR4</name>
          <description>RCC public configuration set register 4</description>
          <addressOffset>0xfcc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACLKNPUBS</name>
              <description>Public protection of ACLKN configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACLKNCPUBS</name>
              <description>Public protection of ACLKNC configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBMPUBS</name>
              <description>Public protection of AHBM configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB1PUBS</name>
              <description>Public protection of AHB1 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2PUBS</name>
              <description>Public protection of AHB2 configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB3PUBS</name>
              <description>Public protection of AHB3 configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB4PUBS</name>
              <description>Public protection of AHB4 configuration bits (enable, ready, divider)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB5PUBS</name>
              <description>Public protection of AHB5 configuration bits (enable, ready, divider)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB1PUBS</name>
              <description>Public protection of APB1 configuration bits (enable, ready, divider)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB2PUBS</name>
              <description>Public protection of APB2 configuration bits (enable, ready, divider)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB3PUBS</name>
              <description>Public protection of APB3 configuration bits (enable, ready, divider)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB4PUBS</name>
              <description>Public protection of APB4 configuration bits (enable, ready, divider)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB5PUBS</name>
              <description>Public protection of APB5 configuration bits (enable, ready, divider)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOCPUBS</name>
              <description>Public protection of NOC configuration bits (enable, ready, divider)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGSR5</name>
          <description>RCC public configuration set register 5</description>
          <addressOffset>0xfd0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AXISRAM3PUBS</name>
              <description>Public protection of AXISRAM3 configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM4PUBS</name>
              <description>Public protection of AXISRAM4 configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM5PUBS</name>
              <description>Public protection of AXISRAM5 configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM6PUBS</name>
              <description>Public protection of AXISRAM6 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBSRAM1PUBS</name>
              <description>Public protection of AHBSRAM1 configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBSRAM2PUBS</name>
              <description>Public protection of AHBSRAM2 configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKPSRAMPUBS</name>
              <description>Public protection of BKPSRAM configuration bits (enable, ready, divider)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM1PUBS</name>
              <description>Public protection of AXISRAM1 configuration bits (enable, ready, divider)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM2PUBS</name>
              <description>Public protection of AXISRAM2 configuration bits (enable, ready, divider)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLEXRAMPUBS</name>
              <description>Public protection of FLEXRAM configuration bits (enable, ready, divider)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CACHEAXIRAMPUBS</name>
              <description>Public protection of CACHEAXIRAM configuration bits (enable, ready, divider)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VENCRAMPUBS</name>
              <description>Public protection of VENCRAM configuration bits (enable, ready, divider)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>RCC control clear register</description>
          <addressOffset>0x1000</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LSIONC</name>
              <description>LSI oscillator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSEONC</name>
              <description>LSE oscillator enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSIONC</name>
              <description>MSI oscillator enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSIONC</name>
              <description>HSI oscillator enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSEONC</name>
              <description>HSE oscillator enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL1ONC</name>
              <description>PLL1 oscillator enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL2ONC</name>
              <description>PLL2 oscillator enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL3ONC</name>
              <description>PLL3 oscillator enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLL4ONC</name>
              <description>PLL4 oscillator enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STOPCCR</name>
          <description>RCC Stop mode configuration clear register</description>
          <addressOffset>0x1008</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MSISTOPENC</name>
              <description>MSI oscillator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSISTOPENC</name>
              <description>HSI oscillator enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MISCRSTCR</name>
          <description>RCC miscellaneous reset clear register</description>
          <addressOffset>0x1208</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBGRSTC</name>
              <description>DBG reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPIPHY1RSTC</name>
              <description>XSPIPHY1 reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XSPIPHY2RSTC</name>
              <description>XSPIPHY2 reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC1DLLRSTC</name>
              <description>SDMMC1DLL reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC2DLLRSTC</name>
              <description>SDMMC2DLL reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMRSTCR</name>
          <description>RCC memory reset clear register</description>
          <addressOffset>0x120c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AXISRAM3RSTC</name>
              <description>AXISRAM3 reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM4RSTC</name>
              <description>AXISRAM4 reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM5RSTC</name>
              <description>AXISRAM5 reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM6RSTC</name>
              <description>AXISRAM6 reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBSRAM1RSTC</name>
              <description>AHBSRAM1 reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBSRAM2RSTC</name>
              <description>AHBSRAM2 reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM1RSTC</name>
              <description>AXISRAM1 reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM2RSTC</name>
              <description>AXISRAM2 reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLEXRAMRSTC</name>
              <description>FLEXRAM reset</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CACHEAXIRAMRSTC</name>
              <description>CACHEAXIRAM reset</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VENCRAMRSTC</name>
              <description>VENCRAM reset</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOTROMRSTC</name>
              <description>Boot ROM reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB1RSTCR</name>
          <description>RCC AHB1 reset clear register</description>
          <addressOffset>0x1210</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GPDMA1RSTC</name>
              <description>GPDMA1 reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC12RSTC</name>
              <description>ADC12 reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB2RSTCR</name>
          <description>RCC AHB2 reset clear register</description>
          <addressOffset>0x1214</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RAMCFGRSTC</name>
              <description>RAMCFG reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MDF1RSTC</name>
              <description>MDF1 reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADF1RSTC</name>
              <description>ADF1 reset</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB3RSTCR</name>
          <description>RCC AHB3 reset r clear register</description>
          <addressOffset>0x1218</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>RNGRSTC</name>
              <description>RNG reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HASHRSTC</name>
              <description>HASH reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRYPRSTC</name>
              <description>CRYP reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAESRSTC</name>
              <description>SAES reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKARSTC</name>
              <description>PKA reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IACRSTC</name>
              <description>IAC reset</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
