modm-ext/data.modm.io/docs/svd/header_stm32n657xx.svd
        <register>
          <name>PUBCFGCR2</name>
          <description>RCC divider public configuration clear register 2</description>
          <addressOffset>0x17ac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IC1PUBC</name>
              <description>Public protection of IC1 configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2PUBC</name>
              <description>Public protection of IC2 configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3PUBC</name>
              <description>Public protection of IC3 configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4PUBC</name>
              <description>Public protection of IC4 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC5PUBC</name>
              <description>Public protection of IC5 configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC6PUBC</name>
              <description>Public protection of IC6 configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC7PUBC</name>
              <description>Public protection of IC7 configuration bits (enable, ready, divider)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC8PUBC</name>
              <description>Public protection of IC8 configuration bits (enable, ready, divider)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC9PUBC</name>
              <description>Public protection of IC9 configuration bits (enable, ready, divider)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC10PUBC</name>
              <description>Public protection of IC10 configuration bits (enable, ready, divider)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC11PUBC</name>
              <description>Public protection of IC11 configuration bits (enable, ready, divider)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC12PUBC</name>
              <description>Public protection of IC12 configuration bits (enable, ready, divider)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC13PUBC</name>
              <description>Public protection of IC13 configuration bits (enable, ready, divider)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC14PUBC</name>
              <description>Public protection of IC14 configuration bits (enable, ready, divider)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC15PUBC</name>
              <description>Public protection of IC15 configuration bits (enable, ready, divider)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC16PUBC</name>
              <description>Public protection of IC16 configuration bits (enable, ready, divider)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC17PUBC</name>
              <description>Public protection of IC17 configuration bits (enable, ready, divider)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC18PUBC</name>
              <description>Public protection of IC18 configuration bits (enable, ready, divider)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC19PUBC</name>
              <description>Public protection of IC19 configuration bits (enable, ready, divider)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC20PUBC</name>
              <description>Public protection of IC20 configuration bits (enable, ready, divider)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGCR3</name>
          <description>RCC system privilege configuration clear register 3</description>
          <addressOffset>0x17b4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODPRIVC</name>
              <description>Privileged protection of MOD configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSPRIVC</name>
              <description>Privileged protection of SYS configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSPRIVC</name>
              <description>Privileged protection of BUS configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERPRIVC</name>
              <description>Privileged protection of PER configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTPRIVC</name>
              <description>Privileged protection of INT configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTPRIVC</name>
              <description>Privileged protection of RST configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGCR3</name>
          <description>RCC system public configuration clear register 3</description>
          <addressOffset>0x17bc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODPUBC</name>
              <description>Public protection of MOD configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSPUBC</name>
              <description>Public protection of SYS configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSPUBC</name>
              <description>Public protection of BUS configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERPUBC</name>
              <description>Public protection of PER configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTPUBC</name>
              <description>Public protection of INT configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTPUBC</name>
              <description>Public protection of RST configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGCR4</name>
          <description>RCC privilege configuration clear register 4</description>
          <addressOffset>0x17c4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACLKNPRIVC</name>
              <description>Privileged protection of ACLKN configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACLKNCPRIVC</name>
              <description>Privileged protection of ACLKNC configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBMPRIVC</name>
              <description>Privileged protection of AHBM configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB1PRIVC</name>
              <description>Privileged protection of AHB1 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2PRIVC</name>
              <description>Privileged protection of AHB2 configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB3PRIVC</name>
              <description>Privileged protection of AHB3 configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB4PRIVC</name>
              <description>Privileged protection of AHB4 configuration bits (enable, ready, divider)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB5PRIVC</name>
              <description>Privileged protection of AHB5 configuration bits (enable, ready, divider)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB1PRIVC</name>
              <description>Privileged protection of APB1 configuration bits (enable, ready, divider)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB2PRIVC</name>
              <description>Privileged protection of APB2 configuration bits (enable, ready, divider)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB3PRIVC</name>
              <description>Privileged protection of APB3 configuration bits (enable, ready, divider)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB4PRIVC</name>
              <description>Privileged protection of APB4 configuration bits (enable, ready, divider)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB5PRIVC</name>
              <description>Privileged protection of APB5 configuration bits (enable, ready, divider)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOCPRIVC</name>
              <description>Privileged protection of NOC configuration bits (enable, ready, divider)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGCR4</name>
          <description>RCC public configuration clear register 4</description>
          <addressOffset>0x17cc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ACLKNPUBC</name>
              <description>Public protection of ACLKN configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACLKNCPUBC</name>
              <description>Public protection of ACLKNC configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBMPUBC</name>
              <description>Public protection of AHBM configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB1PUBC</name>
              <description>Public protection of AHB1 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2PUBC</name>
              <description>Public protection of AHB2 configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB3PUBC</name>
              <description>Public protection of AHB3 configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB4PUBC</name>
              <description>Public protection of AHB4 configuration bits (enable, ready, divider)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB5PUBC</name>
              <description>Public protection of AHB5 configuration bits (enable, ready, divider)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB1PUBC</name>
              <description>Public protection of APB1 configuration bits (enable, ready, divider)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB2PUBC</name>
              <description>Public protection of APB2 configuration bits (enable, ready, divider)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB3PUBC</name>
              <description>Public protection of APB3 configuration bits (enable, ready, divider)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB4PUBC</name>
              <description>Public protection of APB4 configuration bits (enable, ready, divider)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB5PUBC</name>
              <description>Public protection of APB5 configuration bits (enable, ready, divider)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOCPUBC</name>
              <description>Public protection of NOC configuration bits (enable, ready, divider)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGCR5</name>
          <description>RCC public configuration clear register 5</description>
          <addressOffset>0x17d0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AXISRAM3PUBC</name>
              <description>Public protection of AXISRAM3 configuration bits (enable, ready, divider)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM4PUBC</name>
              <description>Public protection of AXISRAM4 configuration bits (enable, ready, divider)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM5PUBC</name>
              <description>Public protection of AXISRAM5 configuration bits (enable, ready, divider)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM6PUBC</name>
              <description>Public protection of AXISRAM6 configuration bits (enable, ready, divider)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBSRAM1PUBC</name>
              <description>Public protection of AHBSRAM1 configuration bits (enable, ready, divider)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBSRAM2PUBC</name>
              <description>Public protection of AHBSRAM2 configuration bits (enable, ready, divider)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKPSRAMPUBC</name>
              <description>Public protection of BKPSRAM configuration bits (enable, ready, divider)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM1PUBC</name>
              <description>Public protection of AXISRAM1 configuration bits (enable, ready, divider)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM2PUBC</name>
              <description>Public protection of AXISRAM2 configuration bits (enable, ready, divider)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLEXRAMPUBC</name>
              <description>Public protection of FLEXRAM configuration bits (enable, ready, divider)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CACHEAXIRAMPUBC</name>
              <description>Public protection of CACHEAXIRAM configuration bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VENCRAMPUBC</name>
              <description>Public protection of VENCRAM configuration bits (enable, ready, divider)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
