modm-ext/data.modm.io/docs/svd/header_stm32n657xx.svd
        <register>
          <name>L1CR</name>
          <description>LTDC layer x control register</description>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LEN</name>
              <description>layer enable: the bit is used to enable/disable the presence of this whole layer.This bit is set and cleared by software.- 0: layer disabled- 1: layer enabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKEN</name>
              <description>color keying enableThis bit is set and cleared by software.- 0: color keying disabled- 1: color keying enabled: if RGB matches, then the ARGB are set to 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VPDEN</name>
              <description>vertical pixel duplication enableThis bit is set and cleared by software.- 0: duplication disabled- 1: duplication enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLUTEN</name>
              <description>color look-up table enableThis bit is set and cleared by software.- 0: color look-up table disabled- 1: color look-up table enabledThe CLUT is only meaningful for L8, AL44 and AL88 pixel format. Refer to Color look-up table (CLUT)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HMEN</name>
              <description>horizontal mirroring enableThis bit is set and cleared by software.- 0: mirror disabled- 1: mirror enabled (if so, the color frame buffer start address has to be set to the last byte of the first line, so for instannce: if line is 100 pixels, 24bpp, then address is set to 299)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCBEN</name>
              <description>default color blending enableThis bit is set and cleared by software.- 0: blending disabled- 1: blending enabled</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>L1WHPCR</name>
          <description>LTDC layer x window horizontal position configuration register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WHSTPOS</name>
              <description>window horizontal start positionThese bits configure the first visible pixel of a line of the layer window.WHSTPOS[15:0] must be &gt;= AAW[15:0] bits (programmed in LTDC_AWCR register)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>WHSPPOS</name>
              <description>window horizontal stop positionThese bits configure the last visible pixel of a line of the layer window.WHSPPOS[15:0] must be &lt;= AHBP[15:0] bits + 1 (programmed in LTDC_BPCR register)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>L1WVPCR</name>
          <description>LTDC layer x window vertical position configuration register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WVSTPOS</name>
              <description>window vertical start positionThese bits configure the first visible line of the layer window.WVSTPOS[15:0] must be &gt;= AAH[15:0] bits (programmed in LTDC_AWCR register)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>WVSPPOS</name>
              <description>window vertical stop positionThese bits configure the last visible line of the layer window.WVSPPOS[11:0] must be &lt;= AVBP[15:0] bits + 1 (programmed in LTDC_BPCR register)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>L1CKCR</name>
          <description>LTDC layer x color keying configuration register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CKBLUE</name>
              <description>color key blue value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CKGREEN</name>
              <description>color key green value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CKRED</name>
              <description>color key red value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>L1PFCR</name>
          <description>LTDC layer x pixel format configuration register</description>
          <addressOffset>0x11c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PF</name>
              <description>pixel formatThese bits configure the pixel format- 000: ARGB8888- 001: RGB888- 010: RGB565- 011: ARGB1555- 100: ARGB4444- 101: L8 (8-bit luminance)- 110: AL44 (4-bit alpha, 4-bit luminance)- 111: AL88 (8-bit alpha, 8-bit luminance)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>L1CACR</name>
          <description>LTDC layer x constant alpha configuration register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CONSTA</name>
              <description>constant alphaThese bits configure the constant alpha used for blending. The constant alpha is divided by 255 by hardware.Example: if the programmed constant alpha is 0xFF, the constant alpha value is 255 / 255 = 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>L1DCCR</name>
          <description>LTDC layer x default color configuration register</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DCBLUE</name>
              <description>default color blueThese bits configure the default blue value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DCGREEN</name>
              <description>default color greenThese bits configure the default green value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DCRED</name>
              <description>default color redThese bits configure the default red value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DCALPHA</name>
              <description>default color alphaThese bits configure the default alpha value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>L1BFCR</name>
          <description>LTDC layer x blending factors configuration register</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BF2</name>
              <description>blending factor 2These bits select the blending factor F2- 000: reserved- 001: reserved- 010: reserved- 011: reserved- 100: reserved- 101: 1 - constant alpha- 110: reserved- 111: 1 - (pixel alpha x constant alpha)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>BF1</name>
              <description>blending factor 1These bits select the blending factor F1.- 000: reserved- 001: reserved- 010: reserved- 011: reserved- 100: constant alpha- 101: reserved- 110: pixel alpha x constant alpha- 111: reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>BOR</name>
              <description>blending orderThese bits select the blending orderBOR.BOR= 0000 is for the most background layer (usually hidden behind others)BOR= 1111 is for the most foreground layer (always visible, never hidden by any other).In case of inconsistency, like two layers at same order, the blending engine reverses to BOR[LayerID] = LayerID-1, so that Layer3 is in foreground and Layer1 is in background.Note: if the Layer3 is set as secure, to guarantee it is on the foreground, it should be configured with BOR(Layer3)=1111</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>L1BLCR</name>
          <description>LTDC layer x burst length configuration register</description>
          <addressOffset>0x12c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BL</name>
              <description>burst length- 0x00: maximum burst length (16 words 64bit, thus 128 Bytes)- 0x01: 1 word (of 64bit) per burst..- 0x10: 16 words (of 64bit) per burst- 0x11: reserved...- 0xFF: reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>L1PCR</name>
          <description>LTDC layer x planar configuration register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>YCEN</name>
              <description>YCbCr-to-RGB Conversion Enable:- 0: conversion disabled.- 1: YCbCr conversion enabled, using the YCM setting above</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>YCM</name>
              <description>YCbCr Conversion ModeDefined the type of input that is considered and converted to a YCbCr 444:- 00: interleaved 422 (Cb and Cr component are replicated horizontally for pixels P and P+1)- 01: semi-Planar 420: (Cb and Cr component are replicated horizontally and vertically. The layer main configuration defines the access to the Y buffer, and auxiliary registers define the access to the Cb and Cr buffers).- 10: full-Planar 420: (Cb and Cr component are replicated horizontally and vertically. The layer main configuration defines the access to the Y buffer, and auxiliary registers define the access to the Cb and Cr buffers).- 11: reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>YF</name>
              <description>Y Component FirstDefines if the byte 0 of a word (in LSB) contains the Y component.- 0: Y component disabled (thus Cr or Cb component is on byte 0)- 1: Y component enabled (thus Y component is on byte 0)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CBF</name>
              <description>Cb Component FirstDefines if the byte 0 and 1 of a word (in LSB) contains the Cb component. The setting impacts only for interleaved and semi-planar modes, as it has no meaning in full-planar mode)- 0: Cb disabled (thus Cr component is on byte 0 and 1)- 1: Cb enabled (thus Cb component is on byte 0 and 1)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OF</name>
              <description>Odd Pixel FirstDefines if the byte 0 of a word (in LSB) contains the Odd pixel.- 0: odd pixel disabled (thus even pixel on byte 0)- 1: odd pixel enabled (thus odd pixel on byte 0)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>YREN</name>
              <description>Y Rescale EnableWhen enabled, incoming Y values in range 16..235 are re-scaled to range 0..255, - 0: rescaling disabled.- 1: rescaling enabled</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>L1CFBAR</name>
          <description>LTDC layer x color frame buffer address register</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CFBADD</name>
              <description>color frame buffer start addressThese bits define the color frame buffer start address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>L1CFBLR</name>
          <description>LTDC layer x color frame buffer length register</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CFBLL</name>
              <description>color frame buffer line lengthThese bits define the length of one line of pixels in bytes + 7.The line length is computed as follows:active high width number of bytes per pixel + 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
            <field>
              <name>CFBP</name>
              <description>color frame buffer pitch in bytesThese bits define the pitch that is the increment from the start of one line of pixels to the start of the next line in bytes.Negative values (with msb bit = 1) are allowed, to read the buffer from bottom to top, and thus to flip is vertically. When vertically flipped, as the address register must provide the address of the first line to be read, the address register must point to the start of the bottom line of the buffer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>L1CFBLNR</name>
          <description>LTDC layer x color frame buffer line number register</description>
          <addressOffset>0x13c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CFBLNBR</name>
              <description>frame buffer line numberThese bits define the number of lines in the frame buffer that corresponds to the active high width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFBA0R1</name>
          <description>LTDC layer x auxiliary frame buffer address 0 register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AFBA1R1</name>
          <description>LTDC layer x auxiliary frame buffer address 1 register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AFBLR1</name>
          <description>LTDC layer x auxiliary frame buffer length register</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>AFBLNR1</name>
          <description>LTDC layer x auxiliary frame buffer line number register</description>
          <addressOffset>0x14c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>L1CLUTWR</name>
          <description>LTDC layer x CLUT write register</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLUE</name>
              <description>blue valueThese bits configure the blue value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>GREEN</name>
              <description>green valueThese bits configure the green value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>RED</name>
              <description>red valueThese bits configure the red value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CLUTADD</name>
              <description>CLUT addressThese bits configure the CLUT address (color position within the CLUT) of each RGB value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SISR1</name>
          <description>LTDC layer x Scaler Input Size register</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SOSR1</name>
          <description>LTDC layer x Scaler Output Size register</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SVSFR1</name>
          <description>LTDC layer x Scaler Vertical Scaling Factor register</description>
          <addressOffset>0x15c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SVSPR1</name>
          <description>LTDC layer x Scaler Vertical Scaling Phase register</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SHSFR1</name>
          <description>LTDC layer x Scaler Horizontal Scaling Factor register</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>SHSPR1</name>
          <description>LTDC layer x Scaler Horizontal Scaling Phase register</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>L1CYR0R</name>
          <description>LTDC layer x Conversion YCbCr RGB 0 register</description>
          <addressOffset>0x16c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CR2R</name>
              <description>Cr-to-Red coefficient, with bits 9:8 as positive integer and 7:0 as decimals</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CB2B</name>
              <description>Cb-to-Blue coefficient, with bits 9:8 as positive integer and 7:0 as decimals</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>L1CYR1R</name>
          <description>LTDC layer x Conversion YCbCr RGB 1 register</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CR2G</name>
              <description>Cr-to-Green coefficient, with bits 9:8 as positive integer and 7:0 as decimals</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>CB2G</name>
              <description>Cb-to-Green coefficient, with bits 9:8 as positive integer and 7:0 as decimals</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>L1FPF0R</name>
          <description>LTDC layer x Flexible Pixel Format 0 register</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>APOS</name>
              <description>Location of the alpha component inside the pixel memory word (in bits)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>ALEN</name>
              <description>Width of the alpha component (in bits)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RPOS</name>
              <description>Location of the red component inside the pixel memory word (in bits)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>RLEN</name>
              <description>Width of the red component (in bits)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>L1FPF1R</name>
          <description>LTDC layer x Flexible Pixel Format 1 register</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>GPOS</name>
              <description>Location of the alpha component inside the pixel memory word (in bits)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>GLEN</name>
              <description>Width of the alpha component (in bits)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>BPOS</name>
              <description>Location of the red component inside the pixel memory word (in bits)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>BLEN</name>
              <description>Width of the red component (in bits)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Width of the red component (in bits)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
