modm-ext/data.modm.io/docs/svd/header_stm32n657xx.svd
        <register>
          <name>P1CPPM2AR1</name>
          <description>DCMIPP Pipe1 current pixel packer memory2 address register 1</description>
          <addressOffset>0xbe4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M2A</name>
              <description>Memory 2 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CPPM2AR2</name>
          <description>DCMIPP Pipe1 current pixel packer Memory2 address register 2</description>
          <addressOffset>0xbe8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>P2FSCR</name>
          <description>DCMIPP Pipe2 flow selection configuration register</description>
          <addressOffset>0xc04</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DTIDA</name>
              <description>Data type ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>VC</name>
              <description>Flow selection mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FDTF</name>
              <description>Force Data type format</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>FDTFEN</name>
              <description>Force Data type format enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PIPEN</name>
              <description>Activation of PipeN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2FCTCR</name>
          <description>DCMIPP Pipe2 flow control configuration register</description>
          <addressOffset>0xd00</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRATE</name>
              <description>Frame capture rate control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPTMODE</name>
              <description>Capture mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPTREQ</name>
              <description>Capture requested</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2CRSTR</name>
          <description>DCMIPP Pipe2 crop window start register</description>
          <addressOffset>0xd04</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSTART</name>
              <description>Vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2CRSZR</name>
          <description>DCMIPP Pipe2 crop window size register</description>
          <addressOffset>0xd08</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DCCR</name>
          <description>DCMIPP Pipe2 decimation register</description>
          <addressOffset>0xd0c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Decimation enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDEC</name>
              <description>Horizontal decimation ratio</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VDEC</name>
              <description>Vertical decimation ratio</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DSCR</name>
          <description>DCMIPP Pipe2 downsize configuration register</description>
          <addressOffset>0xd10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HDIV</name>
              <description>Horizontal division factor, from 128 (8x) to 1023 (1x)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>VDIV</name>
              <description>Vertical division factor, from 128 (8x) to 1023 (1x)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DSRTIOR</name>
          <description>DCMIPP Pipe2 downsize ratio register</description>
          <addressOffset>0xd14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HRATIO</name>
              <description>Horizontal ratio, from 8192 (1x) to 65535 (8x)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>VRATIO</name>
              <description>Vertical ratio, from 8192 (1x) to 65535 (8x)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2DSSZR</name>
          <description>DCMIPP Pipe2 downsize destination size register</description>
          <addressOffset>0xd18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2CMRICR</name>
          <description>DCMIPP Pipe2 common ROI configuration register</description>
          <addressOffset>0xd20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ROILSZ</name>
              <description>Region of interest line size width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ROI1EN</name>
              <description>Region Of Interest 1 Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROI2EN</name>
              <description>Region Of Interest 2 Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROI3EN</name>
              <description>Region Of Interest 3 Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROI4EN</name>
              <description>Region Of Interest 4 Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROI5EN</name>
              <description>Region Of Interest 5 Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROI6EN</name>
              <description>Region Of Interest 6 Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROI7EN</name>
              <description>Region Of Interest 7 Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ROI8EN</name>
              <description>Region Of Interest 8 Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2RIxCR1</name>
          <description>DCMIPP Pipe2 ROIx configuration register 1</description>
          <addressOffset>0xd24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Horizontal start</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>CLB</name>
              <description>Color line blue</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CLG</name>
              <description>Color line green</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>VSTART</name>
              <description>Vertical start</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>CLR</name>
              <description>Color line red</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2RIxCR2</name>
          <description>DCMIPP Pipe2 ROIx configuration register 2</description>
          <addressOffset>0xd28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>VSIZE</name>
              <description>Vertical Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>HSIZE</name>
              <description>Horizontal Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2GMCR</name>
          <description>DCMIPP Pipe2 gamma configuration register</description>
          <addressOffset>0xd70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2PPCR</name>
          <description>DCMIPP Pipe2 pixel packer configuration register</description>
          <addressOffset>0xdc0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FORMAT</name>
              <description>Memory format (only coplanar formats are supported in Pipe2)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SWAPRB</name>
              <description>Swaps R-vs-B components if RGB, and if YUV, swaps U-vs-V components</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LINEMULT</name>
              <description>Amount of capture completed lines for LINE Event and Interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DBM</name>
              <description>Double buffer mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LMAWM</name>
              <description>Line multi address wrapping modulo</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LMAWE</name>
              <description>Line multi address wrapping enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2PPM0AR1</name>
          <description>DCMIPP Pipe2 pixel packer Memory0 address register 1</description>
          <addressOffset>0xdc4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M0A</name>
              <description>Memory0 address register 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2PPM0AR2</name>
          <description>DCMIPP Pipe2 pixel packer Memory0 address register 2</description>
          <addressOffset>0xdc8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>M0A</name>
              <description>Memory0 address register 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2PPM0PR</name>
          <description>DCMIPP Pipe2 pixel packer Memory0 pitch register</description>
          <addressOffset>0xdcc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PITCH</name>
              <description>Number of bytes between the address of two consecutive lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2STM0AR</name>
          <description>DCMIPP Pipe2 status Memory0 address register</description>
          <addressOffset>0xdd0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>P2STM0AR</name>
              <description>Pipe2 status Memory0 address register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2IER</name>
          <description>DCMIPP Pipe2 interrupt enable register</description>
          <addressOffset>0xdf4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LINEIE</name>
              <description>Multi-line capture completed interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRAMEIE</name>
              <description>Frame capture completed interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSYNCIE</name>
              <description>VSYNC interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRIE</name>
              <description>Overrun interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2SR</name>
          <description>DCMIPP Pipe2 status register</description>
          <addressOffset>0xdf8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LINEF</name>
              <description>Multi-line capture completed raw interrupt status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRAMEF</name>
              <description>Frame capture completed raw interrupt status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VSYNCF</name>
              <description>VSYNC raw interrupt status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRF</name>
              <description>Overrun raw interrupt status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSTLINE</name>
              <description>Last line LSB bit, sampled at frame capture complete event</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LSTFRM</name>
              <description>Last frame LSB bit, sampled at frame capture complete event</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPTACT</name>
              <description>Capture immediate status</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2FCR</name>
          <description>DCMIPP Pipe2 interrupt clear register</description>
          <addressOffset>0xdfc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLINEF</name>
              <description>Multi-line capture complete interrupt status clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CFRAMEF</name>
              <description>Frame capture complete interrupt status clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CVSYNCF</name>
              <description>Vertical synchronization interrupt status clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COVRF</name>
              <description>Overrun interrupt status clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2CFSCR</name>
          <description>DCMIPP Pipe2 current flow selection configuration register</description>
          <addressOffset>0xe04</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DTID</name>
              <description>Current Data type ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>VC</name>
              <description>Current flow selection mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FDTF</name>
              <description>Current force Data type format</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>FDTFEN</name>
              <description>Current force Data type format enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PIPEN</name>
              <description>Current activation of PipeN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2CFCTCR</name>
          <description>DCMIPP Pipe2 current flow control configuration register</description>
          <addressOffset>0xf00</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FRATE</name>
              <description>Frame capture rate control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CPTMODE</name>
              <description>Capture mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPTREQ</name>
              <description>Capture requested</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>P2CCRSTR</name>
          <description>DCMIPP Pipe2 current crop window start register</description>
          <addressOffset>0xf04</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Current horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VSTART</name>
              <description>Current vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
