modm-ext/data.modm.io/docs/svd/header_stm32n657xx.svd
        <register>
          <name>MMCTLPITCR</name>
          <description>Tx LPI transition counter register</description>
          <addressOffset>0x7f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>MMCRLPIMSTR</name>
          <description>Rx LPI microsecond counter register</description>
          <addressOffset>0x7f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>MMCRLPITCR</name>
          <description>Rx LPI transition counter register</description>
          <addressOffset>0x7f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>MMCFPETISR</name>
          <description>MMC FPE Tx interrupt status register</description>
          <addressOffset>0x8a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>MMCFPETIMR</name>
          <description>MMC FPE Tx interrupt mask register</description>
          <addressOffset>0x8a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>MMCFPETFCR</name>
          <description>MMC FPE Tx fragment counter register, -</description>
          <addressOffset>0x8a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>MMCTHRCR</name>
          <description>MMC Tx hold request counter register</description>
          <addressOffset>0x8ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>MMCFPERISR</name>
          <description>MMC FPE Rx interrupt status register</description>
          <addressOffset>0x8c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>MMCFPERIMR</name>
          <description>MMC FPE Rx interrupt mask register</description>
          <addressOffset>0x8c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>MMCRPAER</name>
          <description>MMC Rx packet assembly error register</description>
          <addressOffset>0x8c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>MMCRPSMDER</name>
          <description>MMC Rx packet SMD error register</description>
          <addressOffset>0x8cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>MMCRPAOKR</name>
          <description>MMC Rx packet assembly OK register</description>
          <addressOffset>0x8d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>MMCFPERFCR</name>
          <description>MMC Rx FPE fragments counter register</description>
          <addressOffset>0x8d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>MACL3L4C0R</name>
          <description>L3 and L4 control 0 register</description>
          <addressOffset>0x900</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L3PEN0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3SAM0</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3SAIM0</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3DAM0</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3DAIM0</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3HSBM0</name>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>L3HDBM0</name>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>L4PEN0</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L4SPM0</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L4SPIM0</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L4DPM0</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L4DPIM0</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMCHN0</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMCHEN0</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL4A0R</name>
          <description>Layer4 Address filter 0 register</description>
          <addressOffset>0x904</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L4SP0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>L4DP0</name>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL3A0R0R</name>
          <description>Layer3 Address 0 filter 0 register</description>
          <addressOffset>0x910</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L3A0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL3A1R0R</name>
          <description>Layer3 Address 1 filter 0 register</description>
          <addressOffset>0x914</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L3A1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL3A2R0R</name>
          <description>Layer3 Address 2 filter 0 register</description>
          <addressOffset>0x918</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L3A2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL3A3R0R</name>
          <description>Layer3 Address 3 filter 0 register</description>
          <addressOffset>0x91c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L3A3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL3L4C1R</name>
          <description>L3 and L4 control 1 register</description>
          <addressOffset>0x930</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L3PEN0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3SAM0</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3SAIM0</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3DAM0</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3DAIM0</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L3HSBM0</name>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>L3HDBM0</name>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>L4PEN0</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L4SPM0</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L4SPIM0</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L4DPM0</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>L4DPIM0</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMCHN0</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMCHEN0</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL4A1R</name>
          <description>Layer 4 address filter 1 register</description>
          <addressOffset>0x934</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>MACL3A01R</name>
          <description>Layer3 address 0 filter 1 Register</description>
          <addressOffset>0x940</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L3A0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL3A11R</name>
          <description>Layer3 address 1 filter 1 register</description>
          <addressOffset>0x944</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L3A1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL3A21R</name>
          <description>Layer3 address 2 filter 1 Register</description>
          <addressOffset>0x948</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L3A2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACL3A31R</name>
          <description>Layer3 address 3 filter 1 register</description>
          <addressOffset>0x94c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>L3A3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACIACR</name>
          <description>MAC Indirect Access Control register</description>
          <addressOffset>0xa70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OB</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COM</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUTO</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AOFF</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>MSEL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACTMRQR</name>
          <description>MAC type-based Rx Queue mapping register</description>
          <addressOffset>0xa74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TYP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>TMRQ</name>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PFEX</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACTSCR</name>
          <description>Timestamp control Register</description>
          <addressOffset>0xb00</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TSENA</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSCFUPDT</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSINIT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSUPDT</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSADDREG</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTGE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSENALL</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSCTRLSSR</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSVER2ENA</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSIPENA</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSIPV6ENA</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSIPV4ENA</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSEVNTENA</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSMSTRENA</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SNAPTYPSEL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TSENMACADDR</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ESTI</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXTSSTSM</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AV8021ASMEN</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSSIR</name>
          <description>Subsecond increment register</description>
          <addressOffset>0xb04</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TSS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSTSR</name>
          <description>System time seconds register</description>
          <addressOffset>0xb08</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TSS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSTNR</name>
          <description>System time nanoseconds register</description>
          <addressOffset>0xb0c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TSSS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSTSUR</name>
          <description>System time seconds update register</description>
          <addressOffset>0xb10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TSS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACSTNUR</name>
          <description>System time nanoseconds update register</description>
          <addressOffset>0xb14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TSSS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
            <field>
              <name>ADDSUB</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACTSAR</name>
          <description>Timestamp addend register</description>
          <addressOffset>0xb18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TSAR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACTSSR</name>
          <description>Timestamp status register</description>
          <addressOffset>0xb20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TSSOVF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSTARGT0</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUXTSTRIG</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSTRGTERR0</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSTARGT1</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSTRGTERR1</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXTSSIS</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ATSSTN</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ATSSTM</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ATSNS</name>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACTXTSSNR</name>
          <description>Tx timestamp status nanoseconds register</description>
          <addressOffset>0xb30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXTSSLO</name>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
            <field>
              <name>TXTSSMIS</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACTXTSSSR</name>
          <description>Tx timestamp status seconds register</description>
          <addressOffset>0xb34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXTSSHI</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACACR</name>
          <description>Auxiliary control register</description>
          <addressOffset>0xb40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ATSFC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ATSEN0</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ATSEN1</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ATSEN2</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ATSEN3</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACATSNR</name>
          <description>Auxiliary timestamp nanoseconds register</description>
          <addressOffset>0xb48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AUXTSLO</name>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MACATSSR</name>
          <description>Auxiliary timestamp seconds register</description>
          <addressOffset>0xb4c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AUXTSHI</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
